

{{{modification-time(FORMAT, VC)}}}

* Objective
To define a useful library for people to control the robot without worrying too much about the low level implementation.
Effectively, think high level and let my library deal with low level control of motor controllers.


* Library Directory Structure

Just doing normal python library stuff. Consider it unimportant unless someone complains that they can't access something.


#+CALL: test()

# Local Variables:
# org-confirm-babel-evaluate: (lambda (lang body) (not (string= lang "emacs-lisp")))
# End:


#+NAME: test()
#+BEGIN_SRC sh
tree
#+END_SRC

#+RESULTS: test()
| 0   |                |                 |       |
| ├── | Direction      |                 |       |
| │   | ├──            | Compass.py      |       |
| │   | ├──            | Coordinate.py   |       |
| │   | ├──            | __init__.py     |       |
| │   | └──            | direction.org   |       |
| ├── | Filter         |                 |       |
| │   | ├──            | Sensor.py       |       |
| │   | ├──            | __init__.py     |       |
| │   | └──            | filter.org      |       |
| ├── | Instruction    |                 |       |
| │   | ├──            | Instruction.py  |       |
| │   | ├──            | __init__.py     |       |
| │   | └──            | instruction.org |       |
| ├── | Robot          |                 |       |
| │   | ├──            | __init__.py     |       |
| │   | ├──            | robot.org       |       |
| │   | └──            | robot.py        |       |
| ├── | __init__.py    |                 |       |
| └── | controller.org |                 |       |
|     |                |                 |       |
| 4   | directories,   | 15              | files |
